
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.Управленческий.Записывать = Истина;
	Для Каждого Строка Из Товары Цикл
		Запись = Движения.Управленческий.Добавить();
		Запись.Период = Дата;
		Запись.СчетДт = ПланыСчетов.ПланСчетов.Товары;
		Запись.СчетКт = ПланыСчетов.ПланСчетов.Поставщики;
		Запись.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Товары] = Строка.Товар;
		Запись.Сумма = 100;
	КонецЦикла;


КонецПроцедуры

// Описание
// 	Получает какие-то параметры
// Параметры:
// 	Отказ - Строка - Если что-то пошло не так
// Возвращаемое значение:
// 	Структура - описание:
// 		* Дата - Дата - Дата операции
// 		* Товар - СправочникСсылка.Товары - Какой-то товар
// Пример: блаблаблапример
Функция Параметры(Отказ)
	Возврат Новый Структура("Дата, Товар", ТекущаяДата(), Справочники.Товары.ПустаяСсылка());	
КонецФункции




